<a href="https://colab.research.google.com/github/water-beetle/Python_flearning/blob/master/%2311%20DataFrame_%EA%B3%84%EC%B8%B5%EC%A0%81_%EC%9D%B8%EB%8D%B1%EC%8B%B1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

#계층적 인덱싱

In [0]:
s = pd.Series(np.random.randn(10),
              index=[["a", "a", "a", "b", "b", "b", "c", "c", "d", "d"],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [3]:
s

a  1   -1.211315
   2   -0.730681
   3   -0.787946
b  1   -0.044649
   2   -1.235614
   3   -0.624117
c  1   -1.426607
   2    0.929754
d  2   -0.281967
   3    1.033558
dtype: float64

In [4]:
s.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [5]:
s["b"]

1   -0.044649
2   -1.235614
3   -0.624117
dtype: float64

In [6]:
s["b" : "c"]

b  1   -0.044649
   2   -1.235614
   3   -0.624117
c  1   -1.426607
   2    0.929754
dtype: float64

In [7]:
s[("b", 3)]

-0.6241171468067892

In [8]:
s[:, 2]

a   -0.730681
b   -1.235614
c    0.929754
d   -0.281967
dtype: float64

In [0]:
df = pd.DataFrame(np.arange(12).reshape((4, 3)),
                               index=[["a", "a", "b", "b"], 
                                      [1, 2, 1, 2]],
                               columns=[["Seoul", "Seoul", "Busan"],
                                        ["Green", "Red", "Green"]])

In [40]:
df

    Seoul     Busan
    Green Red Green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

*각각 계층마다 이름 붙이기*

In [0]:
df.index.names = ["key1", "key2"]

In [0]:
df.columns.names = ["city", "color"]

In [43]:
df

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

*열에 대한 계층적 인덱싱*

In [44]:
df["Seoul"]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [45]:
df[("Seoul", "Green")]

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: (Seoul, Green), dtype: int64

In [46]:
df.loc["a"]

city  Seoul     Busan
color Green Red Green
key2
1         0   1     2
2         3   4     5

In [47]:
df.loc[("a", 1)]

city   color
Seoul  Green    0
       Red      1
Busan  Green    2
Name: (a, 1), dtype: int64

In [48]:
df.loc[("a", 1), "Busan"]

color
Green    2
Name: (a, 1), dtype: int64

*계층적 인덱스 정렬*

In [49]:
#axis=0 -> 행방향으로, level=0 -> 최상위 index 기준으로 정렬
df.sort_index(axis = 0, level = 0)

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [51]:
df.sort_index(axis = 0, level = "key2")

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
b    1        6   7     8
a    2        3   4     5
b    2        9  10    11

In [52]:
df.sort_values(by = ("Busan", "Green"))

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

*통계함수 적용*

In [53]:
df.sum(axis = 0, level = 0)

city  Seoul     Busan
color Green Red Green
key1
a         3   5     7
b        15  17    19

In [54]:
df.sum(axis = 1, level = 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [63]:
df.mean(axis = 1, level = "city")

city       Seoul  Busan
key1 key2
a    1       0.5    2.0
     2       3.5    5.0
b    1       6.5    8.0
     2       9.5   11.0

In [0]:
df2 = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                    'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                    'd': [0, 1, 2, 0, 1, 2, 3]})

**DataFrame에서 계층 만들기**

In [65]:
df2

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [0]:
df3 = df2.set_index(["c", "d"])

In [68]:
df3

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [71]:
#값을 유지하면서 index 설정
df2.set_index(["c", "d"], drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [73]:
#현존하는 index를 모두 column level로 올려버리고 기존 index를 정수 index로 대체
df2.reset_index()

   index  a  b    c  d
0      0  0  7  one  0
1      1  1  6  one  1
2      2  2  5  one  2
3      3  3  4  two  0
4      4  4  3  two  1
5      5  5  2  two  2
6      6  6  1  two  3

In [0]:
df4 = pd.DataFrame(np.arange(6).reshape((2, 3)),
                   index=['Seoul', 'Busan'], 
                   columns=['one', 'two', 'three'])
df4.index.name = "city"
df4.columns.name = "number"

In [75]:
df4

number  one  two  three
city
Seoul     0    1      2
Busan     3    4      5

In [0]:
#최하위 컬럼이 취하위 인덱스로 붙음
df5 = df4.stack()

In [78]:
df5

city   number
Seoul  one       0
       two       1
       three     2
Busan  one       3
       two       4
       three     5
dtype: int64

*set_index는 column이 내려와서 기존의 index를 대체(drop=False)로 column을 살릴 수 있다*

*stack()은 column의 최하위계층이 기존 인덱스의 최하위계층으로 내려와서 붙는다*

In [81]:
#최하위 인덱스가 취하위 컬럼으로 붙음
df5.unstack()

number  one  two  three
city
Seoul     0    1      2
Busan     3    4      5

In [82]:
df5.unstack(level = 0)

city    Seoul  Busan
number
one         0      3
two         1      4
three       2      5

In [0]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
s3 = pd.concat([s1, s2], keys=["one", "two"])

In [84]:
s3

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [85]:
s3.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [0]:
df6 = pd.DataFrame({"left": df5, "right": df5 + 5},
                   columns=["left", "right"])
df6.columns.name = "side"

In [87]:
df6

side          left  right
city  number
Seoul one        0      5
      two        1      6
      three      2      7
Busan one        3      8
      two        4      9
      three      5     10

In [88]:
df6.unstack()

side   left           right
number  one two three   one two three
city
Seoul     0   1     2     5   6     7
Busan     3   4     5     8   9    10

In [89]:
df6.unstack(level = "city")

side    left       right
city   Seoul Busan Seoul Busan
number
one        0     3     5     8
two        1     4     6     9
three      2     5     7    10

In [90]:
df6.unstack(level = "city").stack(level = "side")

city          Busan  Seoul
number side
one    left       3      0
       right      8      5
two    left       4      1
       right      9      6
three  left       5      2
       right     10      7